"""task0
Нехай задано список різних випадкових чисел [a1, …, an],
значення n визначає користувач програми. Використовуючи
генератор випадкових чисел, заповнити список [a1, …, an]
елементами:
а) дійсними числами, які лежать в діапазоні від 0 до 1;
б) цілими додатними та від‘ємними числами, які лежать в
діапазоні від – 10 до 10 включно;
в) цілими додатними числами, які лежать в діапазоні від 0
до 50 включно.
""" 

import random   
   
def main():
    n = int(input("Enter value n: "))
    list_a = [random.random() for _ in range(n)]
    print("\na) Дійсні числа [0; 1]:")
    print(list_a)
    
if __name__ == "__main__":
    main()